
    
  Процедура ДополнитьФорму(Форма) Экспорт
	  ИмяФормы = Форма.ИмяФормы;
	  Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		  ДобавитьПолеДЗ_КонтактноеЛицоВГруппаШапкаПраво(Форма);
	  	  ДобавитьПолеДЗ_СогласованнаяСкидкаВГруппаШапкаЛево(Форма); 
	  ИначеЕсли  ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		  ДобавитьПолеДЗ_КонтактноеЛицоПередСуммаДокумента(Форма);
	  ИначеЕсли  ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		  ДобавитьПолеДЗ_КонтактноеЛицоПередСуммаДокумента(Форма);
	  ИначеЕсли  ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		  ДобавитьПолеДЗ_КонтактноеЛицоВГруппаШапкаПраво(Форма);
	  ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		  ДобавитьПолеДЗ_КонтактноеЛицоВГруппаШапкаПраво(Форма);
	  КонецЕсли; 
  КонецПроцедуры
  
Процедура ДобавитьПолеДЗ_КонтактноеЛицоВГруппаШапкаПраво(Форма) 
	  ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;  
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
  КонецПроцедуры 
  
 Процедура ДобавитьПолеДЗ_КонтактноеЛицоПередСуммаДокумента(Форма) 
	  ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;  
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
КонецПроцедуры  
  
 
 Процедура ДобавитьПолеДЗ_СогласованнаяСкидкаВГруппаШапкаЛево(Форма) 
	  ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
	  ПолеВвода.УстановитьДействие("ПриИзменении","ДЗ_СогласованнаяСкидкаПриИзменении");
КонецПроцедуры


Процедура ДобавитьКнопкуРассчитатьСкидку(Форма)
	//Кнопка = Команды.Добавить("ДК_РассчитатьСкидку");
	//Кнопка.Заголовок = "РассчитатьСкидку";
	//Команда.Действие = "РассчитатьСкидкуКонманда";
	//
	
	Кнопка = Форма.Команды.Добавить("КнокаРассчитатьСкидку", Тип("КнопкаФормы"), Форма.ЭлементыДЗ_СогласованнаяСкидкаПриИзменении);
	Кнопка.УстановитьДействие("Действие", "РассчитатьСкидкуКонманда");
	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры
